renjun1234/cox/CoX/CoX_Peripheral/CoX_Peripheral_STM32F1xx/libcox/xsysctl.c
    if (g_pfnRCCHandlerCallbacks[0] != 0)
    {
        g_pfnRCCHandlerCallbacks[0](0, 0, ulStatus, 0);
    }
}

//*****************************************************************************
//
//! \brief Init interrupts callback for the RCC.
//!
//! \param xtPortCallback is callback for the RCC.
//!
//! This function is to init interrupts callback for RCC.
//!
//! \return None.
//
//*****************************************************************************
void 
RCCIntCallbackInit(xtEventCallback pfnCallback)
{
    g_pfnRCCHandlerCallbacks[0] = pfnCallback;
}


//*****************************************************************************
//
//! \brief Provides a small delay.
//!
//! \param ulCount is the number of delay loop iterations to perform.
//!
//! This function provides a means of generating a constant length delay.  It
//! is written in assembly to keep the delay consistent across tool chains,
//! avoiding the need to tune the delay based on the tool chain in use.
//!
//! The loop takes 3 cycles/loop.
//!
//! \return None.
//
//*****************************************************************************
#if defined(gcc) || defined(__GNUC__)
void __attribute__((naked))
SysCtlDelay(unsigned long ulCount)
{
    __asm("    subs    r0, #1\n"
          "    bne     SysCtlDelay\n"
          "    bx      lr");
}
#endif
#if defined(ewarm) || defined(__ICCARM__)
void
SysCtlDelay(unsigned long ulCount)
{
    __asm("    subs    r0, #1\n"
          "    bne.n   SysCtlDelay\n"
          "    bx      lr");
}
#endif
#if defined(rvmdk) || defined(__CC_ARM)
__asm void
SysCtlDelay(unsigned long ulCount)
{
    subs    r0, #1;
    bne     SysCtlDelay;
    bx      lr;
}
#endif

//*****************************************************************************
//
//! \internal
//! Checks a peripheral identifier.
//!
//! \param ulPeripheral is the peripheral identifier.
//!
//! This function determines if a peripheral identifier is valid.
//!
//! \return Returns \b true if the peripheral identifier is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef xDEBUG
static xtBoolean
SysCtlPeripheralValid(unsigned long ulPeripheral)
{
    return(
           (ulPeripheral == SYSCTL_PERIPH_ETHMAC) ||
           (ulPeripheral == SYSCTL_PERIPH_USBOTG) ||
           (ulPeripheral == SYSCTL_PERIPH_TIM11)  ||
           (ulPeripheral == SYSCTL_PERIPH_TIM10)  ||
           (ulPeripheral == SYSCTL_PERIPH_TIM9)   ||
           (ulPeripheral == SYSCTL_PERIPH_ADC3)   ||
           (ulPeripheral == SYSCTL_PERIPH_USART1) ||
           (ulPeripheral == SYSCTL_PERIPH_TIM8)   ||
           (ulPeripheral == SYSCTL_PERIPH_SPI1)   ||
           (ulPeripheral == SYSCTL_PERIPH_TIM1)   ||
           (ulPeripheral == SYSCTL_PERIPH_ADC2)   ||
           (ulPeripheral == SYSCTL_PERIPH_ADC1)   ||
           (ulPeripheral == SYSCTL_PERIPH_IOPG)   ||
           (ulPeripheral == SYSCTL_PERIPH_IOPF)   ||
           (ulPeripheral == SYSCTL_PERIPH_IOPE)   ||
           (ulPeripheral == SYSCTL_PERIPH_IOPD)   ||
           (ulPeripheral == SYSCTL_PERIPH_IOPC)   ||
           (ulPeripheral == SYSCTL_PERIPH_IOPB)   ||
           (ulPeripheral == SYSCTL_PERIPH_IOPA)   ||
           (ulPeripheral == SYSCTL_PERIPH_AFIO)   ||
           (ulPeripheral == SYSCTL_PERIPH_DAC)    ||
           (ulPeripheral == SYSCTL_PERIPH_PWR)    ||
           (ulPeripheral == SYSCTL_PERIPH_BKP)    ||
           (ulPeripheral == SYSCTL_PERIPH_CAN2)   ||
           (ulPeripheral == SYSCTL_PERIPH_CAN1)   ||
           (ulPeripheral == SYSCTL_PERIPH_USB)    ||
           (ulPeripheral == SYSCTL_PERIPH_I2C2)   ||
           (ulPeripheral == SYSCTL_PERIPH_I2C1)   ||
           (ulPeripheral == SYSCTL_PERIPH_UART5)  ||
           (ulPeripheral == SYSCTL_PERIPH_UART4)  ||
           (ulPeripheral == SYSCTL_PERIPH_USART3) ||
           (ulPeripheral == SYSCTL_PERIPH_USART2) ||
           (ulPeripheral == SYSCTL_PERIPH_SPI3)   ||
           (ulPeripheral == SYSCTL_PERIPH_SPI2)   ||
           (ulPeripheral == SYSCTL_PERIPH_WWDG)   ||
           (ulPeripheral == SYSCTL_PERIPH_TIM14)  ||
           (ulPeripheral == SYSCTL_PERIPH_TIM13)  ||
           (ulPeripheral == SYSCTL_PERIPH_TIM12)  ||
           (ulPeripheral == SYSCTL_PERIPH_TIM7)   ||
           (ulPeripheral == SYSCTL_PERIPH_TIM6)   ||
           (ulPeripheral == SYSCTL_PERIPH_TIM5)   ||
           (ulPeripheral == SYSCTL_PERIPH_TIM4)   ||
           (ulPeripheral == SYSCTL_PERIPH_TIM3)   ||
           (ulPeripheral == SYSCTL_PERIPH_TIM2)   
           );
}
#endif

//*****************************************************************************
//
//! Performs a software reset of a peripheral.
//!
//! \param ulPeripheral is the peripheral to reset.
//!
//! This function performs a software reset of the specified peripheral.  An
//! individual peripheral reset signal is asserted for a brief period and then
//! deasserted, returning the internal state of the peripheral to its reset
//! condition.
//!
//! The \e ulPeripheral parameter must be only one of the following values:
//! \b SYSCTL_PERIPH_ADC1.
//!
//! \return None.
//
//*****************************************************************************
void
SysCtlPeripheralReset(unsigned long ulPeripheral)
{
    //
    // Check the arguments.
    //
    xASSERT(SysCtlPeripheralValid(ulPeripheral));

    //
    // Put the peripheral into the reset state.
    //
    xHWREG(g_pulIPRSTRegs[SYSCTL_PERIPH_INDEX(ulPeripheral)]) |=
        SYSCTL_PERIPH_MASK(ulPeripheral);

    //
    // Delay for a little bit.
    //
    SysCtlDelay(16);

    //
    // Take the peripheral out of the reset state.
    //
    xHWREG(g_pulIPRSTRegs[SYSCTL_PERIPH_INDEX(ulPeripheral)]) &=
        ~(SYSCTL_PERIPH_MASK(ulPeripheral));
}

//*****************************************************************************
//
//! Enable a peripheral.
//!
//! \param ulPeripheral is the peripheral to enable.
//!
//! Peripherals are enabled with this function.  At power-up, all peripherals
//! are disabled; they must be enabled in order to operate or respond to
//! register reads/writes.
//!
//! The \e ulPeripheral parameter must be only one of the following values:
//! \b SYSCTL_PERIPH_ADC1.
//!
//! \note It takes five clock cycles after the write to enable a peripheral
//! before the the peripheral is actually enabled.  During this time, attempts
//! to access the peripheral will result in a bus fault.  Care should be taken
//! to ensure that the peripheral is not accessed during this brief time
//! period.
//!
//! \return None.
//
//*****************************************************************************
void
SysCtlPeripheralEnable(unsigned long ulPeripheral)
{
    //
    // Check the arguments.
    //
    xASSERT(SysCtlPeripheralValid(ulPeripheral) ||
            (ulPeripheral == SYSCTL_PERIPH_ETHMACRX) ||
            (ulPeripheral == SYSCTL_PERIPH_ETHMACTX) ||
            (ulPeripheral == SYSCTL_PERIPH_SDIO) ||
            (ulPeripheral == SYSCTL_PERIPH_FSMC) ||
            (ulPeripheral == SYSCTL_PERIPH_CRC) ||
            (ulPeripheral == SYSCTL_PERIPH_FLITF) ||
            (ulPeripheral == SYSCTL_PERIPH_SRAM) ||
            (ulPeripheral == SYSCTL_PERIPH_DMA2) ||
            (ulPeripheral == SYSCTL_PERIPH_DMA1) ||
            (ulPeripheral == SYSCTL_PERIPH_RTC)
            );

    //
    // Enable this peripheral.
    //
    xHWREG(g_pulAXBCLKRegs[SYSCTL_PERIPH_INDEX(ulPeripheral)]) |=
        SYSCTL_PERIPH_MASK(ulPeripheral);
}

//*****************************************************************************
//
//! Disable a peripheral.
//!
//! \param ulPeripheral is the peripheral to disable.
//!
//! Peripherals are disabled with this function.  Once disabled, they will not
//! operate or respond to register reads/writes.
//!
//! The \e ulPeripheral parameter must be only one of the following values:
//! \b SYSCTL_PERIPH_ADC1
//!
//! \return None.
//
//*****************************************************************************
void
SysCtlPeripheralDisable(unsigned long ulPeripheral)
{
    //
    // Check the arguments.
    //
    xASSERT(SysCtlPeripheralValid(ulPeripheral));

    //
    // Disable this peripheral.
    //
    xHWREG(g_pulAXBCLKRegs[SYSCTL_PERIPH_INDEX(ulPeripheral)]) &=
        ~(SYSCTL_PERIPH_MASK(ulPeripheral));
}
        
//*****************************************************************************
//
//! \brief Enables a peripheral.
//!
//! \param ulPeripheralBase a Peripheral base indicate which peripheral to be 
//! enabled.Details please refer to \ref xLowLayer_Peripheral_Memmap.
//!
//! Peripherals are enabled with this function.  At power-up, all peripherals
//! are disabled; they must be enabled in order to operate or respond to
//! register reads/writes.
//!
//! The \e ulPeripheral parameter must be only one of the following values:
//! Details please refer to \ref xLowLayer_Peripheral_Memmap.
//!
//! \note None.
//!
//! \return None.
//
//*****************************************************************************
void 
xSysCtlPeripheralEnable2(unsigned long ulPeripheralBase)
{
    unsigned long i;
    for(i=0; g_pPeripherals[i].ulPeripheralBase != 0; i++)
    {
        if(ulPeripheralBase == g_pPeripherals[i].ulPeripheralBase)
        {
            SysCtlPeripheralEnable(g_pPeripherals[i].ulPeripheralID);
            break;
        }
    }
}
        
//*****************************************************************************
//
//! \brief Disables a peripheral.
//!
//! \param ulPeripheralBase a Peripheral base indicate which peripheral to be 
//! enabled.Details please refer to \ref xLowLayer_Peripheral_Memmap.
//!
//! Peripherals are disabled with this function.  At power-up, all peripherals
//! are disabled; they must be enabled in order to operate or respond to
//! register reads/writes.
//!
//! The \e ulPeripheral parameter must be only one of the following values:
//! Details please refer to \ref xLowLayer_Peripheral_Memmap.
//!
//! \note None.
//!
//! \return None.
//
//*****************************************************************************
void 
xSysCtlPeripheralDisable2(unsigned long ulPeripheralBase)
{
    unsigned long i;
    for(i=0; g_pPeripherals[i].ulPeripheralBase != 0; i++)
    {
        if(ulPeripheralBase == g_pPeripherals[i].ulPeripheralBase)
        {
            SysCtlPeripheralDisable(g_pPeripherals[i].ulPeripheralID);
            break;
        }
    }
}
        
//*****************************************************************************
//
//! \brief Reset a peripheral.
//!
//! \param ulPeripheralBase a Peripheral base indicate which peripheral to be 
//! Reset.Details please refer to \ref xLowLayer_Peripheral_Memmap.
//!
//! Peripherals are Reset with this function.  At power-up, all peripherals
//! are disabled; they must be enabled in order to operate or respond to
//! register reads/writes.
//!
//! The \e ulPeripheral parameter must be only one of the following values:
//! Details please refer to \ref xLowLayer_Peripheral_Memmap.
//!
//! \note None.
//!
//! \return None.
//
//*****************************************************************************
void 
xSysCtlPeripheralReset2(unsigned long ulPeripheralBase)
{
    unsigned long i;
    for(i=0; g_pPeripherals[i].ulPeripheralBase != 0; i++)
    {
        if(ulPeripheralBase == g_pPeripherals[i].ulPeripheralBase)
        {
            SysCtlPeripheralReset(g_pPeripherals[i].ulPeripheralID);
            break;
        }
    }
}

//*****************************************************************************
//
//! \brief Get the peripheral interrupt number through peripheral base.
//!
//! \param ulPeripheral The peripheral's base  
//!
//! \note It's especially useful to enable the short pin's corresponding 
//! peripheral interrupt: Use the short pin to Get the GPIO base through 
//! \ref xGPIOSPinToPort function, and then use this function to enable the GPIO
//! interrupt.
//!
//! \return None.
//
//*****************************************************************************
unsigned long 
xSysCtlPeripheraIntNumGet(unsigned long ulPeripheralBase)
{
    unsigned long i;
    
    //
    // Check the arguments.
    //
    xASSERT(
        (ulPeripheralBase == xFLASH_BASE     )|| 
        (ulPeripheralBase == xSRAM_BASE      )|| 
        (ulPeripheralBase == xWDT_BASE       )|| 
        (ulPeripheralBase == xGPIO_PORTA_BASE)|| 
        (ulPeripheralBase == xGPIO_PORTB_BASE)|| 
        (ulPeripheralBase == xGPIO_PORTC_BASE)|| 
        (ulPeripheralBase == xGPIO_PORTD_BASE)|| 
        (ulPeripheralBase == xGPIO_PORTE_BASE)|| 
        (ulPeripheralBase == xGPIO_PORTF_BASE)|| 
        (ulPeripheralBase == xGPIO_PORTG_BASE)|| 
        (ulPeripheralBase == xUART1_BASE     )|| 
        (ulPeripheralBase == xUART2_BASE     )|| 
        (ulPeripheralBase == xUART3_BASE     )|| 
        (ulPeripheralBase == xUART4_BASE     )|| 
        (ulPeripheralBase == xUART5_BASE     )|| 
        (ulPeripheralBase == xTIMER1_BASE    )|| 
        (ulPeripheralBase == xTIMER2_BASE    )|| 
        (ulPeripheralBase == xTIMER3_BASE    )|| 
        (ulPeripheralBase == xTIMER4_BASE    )|| 
        (ulPeripheralBase == xTIMER5_BASE    )|| 
        (ulPeripheralBase == xTIMER6_BASE    )|| 
        (ulPeripheralBase == xTIMER7_BASE    )|| 
        (ulPeripheralBase == xTIMER8_BASE    )|| 
        (ulPeripheralBase == xTIMER9_BASE    )|| 
        (ulPeripheralBase == xTIMER10_BASE   )|| 
        (ulPeripheralBase == xTIMER11_BASE   )|| 
        (ulPeripheralBase == xTIMER12_BASE   )|| 
        (ulPeripheralBase == xTIMER13_BASE   )|| 
        (ulPeripheralBase == xTIMER14_BASE   )|| 
        (ulPeripheralBase == xSPI1_BASE      )|| 
        (ulPeripheralBase == xSPI2_BASE      )|| 
        (ulPeripheralBase == xSPI3_BASE      )|| 
        (ulPeripheralBase == xI2C1_BASE      )|| 
        (ulPeripheralBase == xI2C2_BASE      )|| 
        (ulPeripheralBase == xADC1_BASE      )|| 
        (ulPeripheralBase == xADC2_BASE      )|| 
        (ulPeripheralBase == xACMP0_BASE     )|| 
        (ulPeripheralBase == xPWMA_BASE      )|| 
        (ulPeripheralBase == xPWMB_BASE      )|| 
        (ulPeripheralBase == xDMA1_BASE      ) 
);

            
    for(i=0; g_pPeripherals[i].ulPeripheralBase != 0; i++)
    {
        if(ulPeripheralBase == g_pPeripherals[i].ulPeripheralBase)
        {
            break;
        }
    }
    return g_pPeripherals[i].ulPeripheralIntNum;
}

//*****************************************************************************
//
//! \brief Sets the clock of the device.
//!
//! \param ulConfig is the required configuration of the device clock.
//!
//! This function configures the clock of the device.  The input crystal
//! frequency, oscillator to be used, use of the PLL, and the system clock
//! divider are all configured with this function.
//!
//! The \e ulConfig parameter is the logical OR of several different values,
//! many of which are grouped into sets where only one can be chosen.
//!
//! The external crystal frequency is chosen with one of the following values:
//! SYSCTL_XTAL_xMHZ (x=4,5,6...16)
//!
//! The oscillator source is chosen with one of the following values:
//! \ref SYSCTL_OSC_MAIN, \ref SYSCTL_OSC_INT.
//!
//! The internal and main oscillators and PLL are disabled with the
//! \ref SYSCTL_INT_OSC_DIS and \ref SYSCTL_MAIN_OSC_DIS flags, 
//! \ref SYSCTL_PLL_PWRDN respectively.
//! The external oscillator must be enabled in order to use an external clock
//! source.  Note that attempts to disable the oscillator used to clock the
//! device will be prevented by the hardware.
//! <br />
//! Details please refer to \ref XSysCtl_Clock_Set_Config_CoX.
//! 
//!
//! \return None.
//
//*****************************************************************************
void
SysCtlClockSet(unsigned long ulSysClk, unsigned long ulConfig)
{
    volatile unsigned long ulStartUpCounter;
    xtBoolean xtStatus;
    unsigned long ulOscFreq;
    xASSERT(((ulSysClk > 0) && (ulSysClk <= 72000000)));

    //
    // Set HSION bit
    //
    xHWREG(RCC_CR) |= RCC_CR_HSION;

    //
    // Reset SW, HPRE, PPRE1, PPRE2, ADCPRE and MCO bits
    //
    //xHWREG(RCC_CFGR) &= 0xF0FF0000;
    xHWREG(RCC_CFGR) &= 0xF8FF0000;
    
    //
    // Reset HSEON, CSSON and PLLON bits 
    //
    xHWREG(RCC_CR) &= 0xFEF6FFFF;

    //
    // Reset HSEBYP bit
    //
    xHWREG(RCC_CR) &= 0xFFFBFFFF;

    //
    // Reset PLLSRC, PLLXTPRE, PLLMUL and USBPRE/OTGFSPRE bits
    //
    xHWREG(RCC_CFGR) &= 0xFF80FFFF;

    //
    // Reset HSEBYP bit
    //
    xHWREG(RCC_CR) &= 0xEBFFFFFF;
    
    //
    // Disable all interrupts and clear pending bits
    //
    xHWREG(RCC_CIR) &= 0x00FF0000;

    xHWREG(RCC_CIR) |= 0x00001800;

    //
    // 
    //
    xHWREG(RCC_CFGR2) = 0x00000000; 
    
    //
    // Calc oscillator freq
    //
    s_ulExtClockMHz = ((ulConfig & SYSCTL_XTAL_MASK) >> 8);
    switch(ulConfig & SYSCTL_OSCSRC_M)
    {
        case SYSCTL_OSC_MAIN:
        case xSYSCTL_OSC_MAIN:
        {
           
            xASSERT(!(ulConfig & SYSCTL_MAIN_OSC_DIS));

