renjun1234/cox/CoX/CoX_Peripheral/CoX_Peripheral_STM32F1xx/libcox/xsysctl.c
            xHWREG(RCC_CR) &= ~RCC_CR_HSEON;
            xHWREG(RCC_CR) &= ~RCC_CR_HSERDY;

            xHWREG(RCC_CR) |= RCC_CR_HSEON;

            //
            // Wait till HSE is ready and if Time out is reached exit 
            //
            do
            {
                xtStatus = (xHWREG(RCC_CR) & RCC_CR_HSERDY) ? xtrue : xfalse;
                ulStartUpCounter++;  
            } while((ulStartUpCounter != 0x0500) && (xtStatus == xfalse));

            if(xtStatus == xtrue)
            {
                xHWREG(RCC_CFGR) &= ~RCC_CFGR_SW_M;
                xHWREG(RCC_CFGR) |= 1;

                while((xHWREG(RCC_CFGR) & RCC_CFGR_SWS_M) != 0x04);
            }
            else
            {
                while(1);
            }
            
            ulOscFreq = s_ulExtClockMHz*1000000; 
            
            if((ulConfig & SYSCTL_INT_OSC_DIS)!=0)
            {
                xHWREG(RCC_CR) &= ~RCC_CR_HSION;
            }
            if((ulConfig & SYSCTL_PLL_PWRDN)!=0)
            {
                //xHWREG(RCC_CR) |= RCC_CR_PLLON;
                xHWREG(RCC_CR) &= ~RCC_CR_PLLON;
            }
            break;
        }
        case SYSCTL_OSC_INT:
        {
            xASSERT(!(ulConfig & SYSCTL_INT_OSC_DIS));

            xHWREG(RCC_CR) |= RCC_CR_HSION;

            //
            // Wait till HSI is ready 
            //
            while((xHWREG(RCC_CR) & RCC_CR_HSIRDY) != RCC_CR_HSIRDY);

            xHWREG(RCC_CFGR) &= ~RCC_CFGR_SW_M;
            xHWREG(RCC_CFGR) |= 0;
            
            while((xHWREG(RCC_CFGR) & RCC_CFGR_SWS_M) != 0x00); 
            
            if((ulConfig & SYSCTL_MAIN_OSC_DIS)!=0)
            {
                xHWREG(RCC_CR) &= ~RCC_CR_HSEON;
            }
            if((ulConfig & SYSCTL_PLL_PWRDN)!=0)
            {
                xHWREG(RCC_CR) |= RCC_CR_PLLON;
            }
            break;
        }
        default:
        {
            xASSERT(0);
            break;
        }
    }
    
    //
    //Enable prefetch Buffer 
    //
    xHWREG(FLASH_ACR) |= FLASH_ACR_PRFTBS;       
    
    if (ulSysClk <= 24000000UL)
    {
        //
        //Flash 0 wait state
        //
        xHWREG(FLASH_ACR) &= ~FLASH_ACR_LATENCY_M;
        xHWREG(FLASH_ACR) |= FLASH_ACR_LATENCY_0; 
    }
    else if(ulSysClk <= 48000000UL)
    {
        //
        //Flash 1 wait state
        //
        xHWREG(FLASH_ACR) &= ~FLASH_ACR_LATENCY_M;
        xHWREG(FLASH_ACR) |= FLASH_ACR_LATENCY_1;  
    }
    else if(ulSysClk <= 72000000UL)
    {
        
        //
        //Flash 2 wait state
        //
        xHWREG(FLASH_ACR) &= ~FLASH_ACR_LATENCY_M;
        xHWREG(FLASH_ACR) |= FLASH_ACR_LATENCY_2;  
    }

    xHWREG(RCC_CFGR) &= ~(RCC_CFGR_PPRE2_M | RCC_CFGR_PPRE1_M | RCC_CFGR_HPRE_M);
    xHWREG(RCC_CFGR) |= SYSCTL_APB1CLOCK_DIV << RCC_CFGR_PPRE1_S;
    xHWREG(RCC_CFGR) |= SYSCTL_APB2CLOCK_DIV << RCC_CFGR_PPRE2_S;
    if(ulSysClk == ulOscFreq)
    {
        return;
    }
    else if (ulSysClk < ulOscFreq)
    {
        if((ulOscFreq % ulSysClk) == 0)
        {            
            int i = 0;
            for (i = 8; i >= 0; i--)
             {
                 if((ulOscFreq/ulSysClk) & (1<<i))
                 {
                     xHWREG(RCC_CFGR) |= (g_AHBPrescTable[i]) << RCC_CFGR_HPRE_S;
                     break;
                 }
             }          
        }
        else
        {
            xASSERT(0);
        }
        
    }
    else
    {
        xASSERT(!(ulConfig & xSYSCTL_PLL_PWRDN));
        xASSERT(((ulConfig & SYSCTL_OSCSRC_M) == xSYSCTL_OSC_MAIN) ||
                ((ulConfig & SYSCTL_OSCSRC_M) == xSYSCTL_OSC_INT));
        
        if((ulConfig & SYSCTL_PLL_MAIN) == SYSCTL_PLL_MAIN)
        {
            if((ulSysClk % ulOscFreq) == 0)
            {
                xHWREG(RCC_CFGR) |= RCC_CFGR_PLLSRC;
                xHWREG(RCC_CFGR) &= ~(RCC_CFGR_PLLXTPRE | RCC_CFGR_PLLMUL_M);
                xHWREG(RCC_CFGR) |= ((ulSysClk / ulOscFreq -2) << 
                                     RCC_CFGR_PLLMUL_S) & RCC_CFGR_PLLMUL_M;
            }
            else if(((ulSysClk*2) % ulOscFreq) == 0)
            {
                xHWREG(RCC_CFGR) |= RCC_CFGR_PLLXTPRE | RCC_CFGR_PLLSRC;
                xHWREG(RCC_CFGR) &= ~(RCC_CFGR_PLLMUL_M);
                xHWREG(RCC_CFGR) |= ((ulSysClk * 2 / ulOscFreq -2) << 
                                     RCC_CFGR_PLLMUL_S) & RCC_CFGR_PLLMUL_M;
            }
            else
            {
                xASSERT(0);
                return;
            }
        }
        else
        {
            if(((ulSysClk*2) % ulOscFreq) == 0)
            {
                xHWREG(RCC_CFGR) &= ~(RCC_CFGR_PLLSRC | RCC_CFGR_PLLMUL_M);
                xHWREG(RCC_CFGR) |= ((ulSysClk * 2 / ulOscFreq) << 
                                     RCC_CFGR_PLLMUL_S) & RCC_CFGR_PLLMUL_M;
            }
            else
            {
                xASSERT(0);
                return;
            }
        }

        xHWREG(RCC_CR) |= RCC_CR_PLLON;
        while((xHWREG(RCC_CR) | RCC_CR_PLLRDY) == 0);

        xHWREG(RCC_CFGR) &= ~RCC_CFGR_SW_M;
        xHWREG(RCC_CFGR) |= RCC_CFGR_SW_PLL;
        while((xHWREG(RCC_CFGR) & RCC_CFGR_SWS_M) != 0x08);

        return;
    }
}


//*****************************************************************************
//
//! \brief Enable the system control interrupts.
//!
//! \param ulIntFlags is the bit mask of the interrupt sources to be enabled.  
//!
//! Enables the indicated Sysctl interrupt sources.  Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor.
//!
//! The \e ulIntFlags parameter is the logical OR of any of the following:
//! \b SYSCTL_INT_LSI, \b SYSCTL_INT_LSE, \b SYSCTL_INT_HSE, 
//! \b SYSCTL_INT_HSI,  \b SYSCTL_INT_PLL,  \b SYSCTL_INT_PLL2,
//! \b SYSCTL_INT_PLL3,
//!
//! \return None.
//
//*****************************************************************************
void 
SysCtlIntEnable(unsigned long ulIntFlags)
{ 
    //
    // Check the arguments.
    //
    xASSERT(
            ((ulIntFlags & SYSCTL_INT_LSI) == SYSCTL_INT_LSI)   || 
            ((ulIntFlags & SYSCTL_INT_LSE) == SYSCTL_INT_LSE)   ||
            ((ulIntFlags & SYSCTL_INT_HSE) == SYSCTL_INT_HSE)   ||
            ((ulIntFlags & SYSCTL_INT_HSI) == SYSCTL_INT_HSI)   ||
            ((ulIntFlags & SYSCTL_INT_PLL) == SYSCTL_INT_PLL)   ||
            ((ulIntFlags & SYSCTL_INT_PLL2) == SYSCTL_INT_PLL2) ||
            ((ulIntFlags & SYSCTL_INT_PLL3) == SYSCTL_INT_PLL3)
           );
    //
    // Enable the specified interrupts.
    //
    xHWREG(RCC_CIR) |= (ulIntFlags << 8);
}

//*****************************************************************************
//
//! \brief Disable the system control interrupts.
//!
//! \param ulIntFlags is the bit mask of the interrupt sources to be disabled.  
//!
//! Disable the indicated Sysctl interrupt sources.  Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor.
//!
//! The \e ulIntFlags parameter is the logical OR of any of the following:
//! \b SYSCTL_INT_LSI, \b SYSCTL_INT_LSE, \b SYSCTL_INT_HSE, 
//! \b SYSCTL_INT_HSI,  \b SYSCTL_INT_PLL,  \b SYSCTL_INT_PLL2,
//! \b SYSCTL_INT_PLL3,
//!
//! \return None.
//
//*****************************************************************************
void 
SysCtlIntDisable(unsigned long ulIntFlags)
{ 
    //
    // Check the arguments.
    //
    xASSERT(
            ((ulIntFlags & SYSCTL_INT_LSI) == SYSCTL_INT_LSI)   || 
            ((ulIntFlags & SYSCTL_INT_LSE) == SYSCTL_INT_LSE)   ||
            ((ulIntFlags & SYSCTL_INT_HSE) == SYSCTL_INT_HSE)   ||
            ((ulIntFlags & SYSCTL_INT_HSI) == SYSCTL_INT_HSI)   ||
            ((ulIntFlags & SYSCTL_INT_PLL) == SYSCTL_INT_PLL)   ||
            ((ulIntFlags & SYSCTL_INT_PLL2) == SYSCTL_INT_PLL2) ||
            ((ulIntFlags & SYSCTL_INT_PLL3) == SYSCTL_INT_PLL3)
           );
    //
    // Enable the specified interrupts.
    //
    xHWREG(RCC_CIR) &= ~(ulIntFlags << 8);
}

//*****************************************************************************
//
//! \brief Clear the system control interrupts flag.
//!
//! \param ulIntFlags is the bit mask of the interrupt flag to be cleared.  
//!
//! Clear the indicated Sysctl interrupt flag.
//!
//! The \e ulIntFlags parameter is the logical OR of any of the following:
//! \b SYSCTL_INT_LSI, \b SYSCTL_INT_LSE, \b SYSCTL_INT_HSE, 
//! \b SYSCTL_INT_HSI,  \b SYSCTL_INT_PLL,  \b SYSCTL_INT_PLL2,
//! \b SYSCTL_INT_PLL3,\b SYSCTL_INT_CSS.
//!
//! \return None.
//
//*****************************************************************************
void
SysCtlIntFlagClear(unsigned long ulIntFlags)
{ 
    //
    // Check the arguments.
    //
    xASSERT(
            ((ulIntFlags & SYSCTL_INT_LSI) == SYSCTL_INT_LSI)   || 
            ((ulIntFlags & SYSCTL_INT_LSE) == SYSCTL_INT_LSE)   ||
            ((ulIntFlags & SYSCTL_INT_HSE) == SYSCTL_INT_HSE)   ||
            ((ulIntFlags & SYSCTL_INT_HSI) == SYSCTL_INT_HSI)   ||
            ((ulIntFlags & SYSCTL_INT_PLL) == SYSCTL_INT_PLL)   ||
            ((ulIntFlags & SYSCTL_INT_PLL2) == SYSCTL_INT_PLL2) ||
            ((ulIntFlags & SYSCTL_INT_CSS) == SYSCTL_INT_CSS)   ||
            ((ulIntFlags & SYSCTL_INT_PLL3) == SYSCTL_INT_PLL3)
           );
    //
    // Enable the specified interrupts.
    //
    xHWREG(RCC_CIR) |= (ulIntFlags << 16);
}

//*****************************************************************************
//
//! \brief Get the system control interrupts flag.
//!
//! \param None.  
//!
//! Get the indicated Sysctl interrupt flag.
//!
//! \return the return value is the logical OR of any of the following:
//! \b SYSCTL_INT_LSI, \b SYSCTL_INT_LSE, \b SYSCTL_INT_HSE, 
//! \b SYSCTL_INT_HSI,  \b SYSCTL_INT_PLL,  \b SYSCTL_INT_PLL2,
//! \b SYSCTL_INT_PLL3,\b SYSCTL_INT_CSS.
//
//*****************************************************************************
unsigned long 
SysCtlIntFlagGet(void)
{ 
    //
    // return the system control interrupts flag.
    //
    return (xHWREG(RCC_CIR) & 0xFF);
}

//*****************************************************************************
//
//! \brief Get the system control reset flag.
//!
//! \param None.  
//!
//! Get the indicated Sysctl reset flag.
//!
//! \return the return value is the logical OR of any of the following:
//! \b SYSCTL_RESET_LPWR, \b SYSCTL_RESET_WWDG, \b SYSCTL_RESET_IWDG,
//! \b SYSCTL_RESET_SFT, \b SYSCTL_RESET_POR, \b SYSCTL_RESET_PIN.
//
//*****************************************************************************
unsigned long
SysCtlResetFlagGet(void)
{ 
    //
    // return the system control reset flag.
    //
    return (xHWREG(RCC_CSR) & 0xFC000000);
}

//*****************************************************************************
//
//! \brief Clear the system control reset flag.
//!
//! \param None.  
//!
//! Clear the indicated Sysctl reset flag.
//!
//! \return None.
//
//*****************************************************************************
void
SysCtlResetFlagClear(void)
{ 
    //
    // Clear the system control reset flag.
    //
    xHWREG(RCC_CSR) |= RCC_CSR_RMVF;
}

//*****************************************************************************
//
//! \brief Config the system control LSI clock.
//!
//! \param ulLSIConfig.  
//!
//! Config the system control LSI clock.
//!
//! \return None.
//
//*****************************************************************************
void
SysCtlLSIConfig(unsigned long ulLSIConfig)
{ 
    //
    // Check the arguments.
    //
    xASSERT(
            (ulLSIConfig == SYSCTL_LSI_OSC_DIS) ||
            (ulLSIConfig == SYSCTL_LSI_OSC_EN)
            );
    
    //
    // Config the system control LSI clock.
    //
    xHWREG(RCC_CSR) &= ~(RCC_CSR_LSION | RCC_CSR_RMVF);
    xHWREG(RCC_CSR) |= ulLSIConfig;
    while(!(xHWREG(RCC_CSR) & RCC_CSR_LSIRDY));
}

//*****************************************************************************
//
//! \brief Config the system control LSE clock.
//!
//! \param ulLSEConfig .  
//!
//! Config the system control LSE clock.
//!
//! \return None.
//
//*****************************************************************************
void
SysCtlLSEConfig(unsigned long ulLSEConfig)
{ 
    //
    // Check the arguments.
    //
    xASSERT((ulLSEConfig == SYSCTL_LSE_OSC_DIS) ||
            (ulLSEConfig == SYSCTL_LSE_OSC_EN));
    //
    // Config the system control LSE clock.
    //
    xHWREG(RCC_BDCR) &= ~RCC_BDCR_LSEON;
    xHWREG(RCC_BDCR) |= ulLSEConfig;
    while(!(xHWREG(RCC_BDCR) & RCC_BDCR_LSERDY));
}

//*****************************************************************************
//
//! \brief Set a peripheral clock source and peripheral divide.
//!
//! \param ulPeripheralSrc is the peripheral clock source to set.
//! \param ulDivide used to set ADC Clock Divide.
//!
//! Peripherals clock source are set with this function.  At power-up, all 
//! Peripherals clock source are DISABLED, so you must enable peripherals clock 
//! before operate register.
//!
//! The \e ulPeripheralSrc parameter must be only one of the following values:
//! \ref STM32F1xx_SysCtl_Stclk_Src.
//!
//! \return None.
//
//*****************************************************************************
void
SysCtlPeripheralClockSourceSet(unsigned long ulPeripheralSrc, unsigned long ulDivide)
{
    //
    // Check the arguments. 
    //
    xASSERT((ulPeripheralSrc == SYSCTL_RTC_LSE)    ||
            (ulPeripheralSrc == SYSCTL_RTC_LSI)    ||
            (ulPeripheralSrc == SYSCTL_RTC_LSE_128)||
            (ulPeripheralSrc == SYSCTL_MCO_SYSCLK) ||
            (ulPeripheralSrc == SYSCTL_MCO_HSI)    ||
            (ulPeripheralSrc == SYSCTL_MCO_HSE)    ||
            (ulPeripheralSrc == SYSCTL_MCO_PLL_2)  ||
            (ulPeripheralSrc == SYSCTL_MCO_PLL3_2) ||
            (ulPeripheralSrc == SYSCTL_MCO_XT1)    ||
            (ulPeripheralSrc == SYSCTL_MCO_PLL3)   ||
            (ulPeripheralSrc == SYSCTL_ADC_HCLK)   ||
            (ulPeripheralSrc == SYSCTL_IWDG_LSI)   ||
            (ulPeripheralSrc == SYSCTL_I2S3_SYSCLK)||
            (ulPeripheralSrc == SYSCTL_I2S3_PLL3)  ||
            (ulPeripheralSrc == SYSCTL_I2S2_SYSCLK)||
            (ulPeripheralSrc == SYSCTL_I2S2_PLL3)  ||
            (ulPeripheralSrc == SYSCTL_MCO_PLL2)         
           );

