renjun1234/cox/CoX/CoX_Peripheral/CoX_Peripheral_STM32F1xx/libcox/xsysctl.c
    xASSERT(
            (ulDivide == 2) ||
            (ulDivide == 4) ||
            (ulDivide == 6) ||
            (ulDivide == 8)
            );

    if(SYSCTL_PERIPH_INDEX_CLK(ulPeripheralSrc) == 1)
    {
        xHWREG(RCC_BDCR) &= ~(RCC_BDCR_RTCSEL_M);
        xHWREG(g_pulCLKSELRegs[SYSCTL_PERIPH_INDEX_CLK(ulPeripheralSrc)]) |=
        SYSCTL_PERIPH_ENUM_CLK(ulPeripheralSrc);
    }
    else if(SYSCTL_PERIPH_INDEX_CLK(ulPeripheralSrc) == 0)
    {
        xHWREG(RCC_CFGR) &= ~(RCC_CFGR_MCO_M);
        xHWREG(g_pulCLKSELRegs[SYSCTL_PERIPH_INDEX_CLK(ulPeripheralSrc)]) |=
        SYSCTL_PERIPH_ENUM_CLK(ulPeripheralSrc);
    }
    else if(SYSCTL_PERIPH_INDEX_CLK(ulPeripheralSrc) == 2)
    {
        xHWREG(RCC_CFGR2) &= ~(SYSCTL_PERIPH_ENUM_CLK(ulPeripheralSrc | 1));
        xHWREG(g_pulCLKSELRegs[SYSCTL_PERIPH_INDEX_CLK(ulPeripheralSrc)]) |=
        SYSCTL_PERIPH_ENUM_CLK(ulPeripheralSrc);
    }
    else if(ulPeripheralSrc==SYSCTL_IWDG_LSI)
    {
        xHWREG(RCC_CSR) |= RCC_CSR_LSION;
    }
    else if(ulPeripheralSrc==SYSCTL_ADC_HCLK)
    {
        ulDivide = (ulDivide/2) - 1;
        ulDivide &= 0x03;
        xHWREG(RCC_CFGR) &= ~RCC_CFGR_ADCPRE_M;
        xHWREG(RCC_CFGR) |= (ulDivide << RCC_CFGR_ADCPRE_S);
    }
    else
    {
        xHWREG(g_pulCLKSELRegs[SYSCTL_PERIPH_INDEX_CLK(ulPeripheralSrc)]) |=
        SYSCTL_PERIPH_ENUM_CLK(ulPeripheralSrc);
    }

}

//*****************************************************************************
//
//! \brief Resets the device.
//!
//! This function will perform a software reset of the entire device.  The
//! processor and all peripherals will be reset and all device registers will
//! return to their default values (with the exception of the reset cause
//! register, which will maintain its current value but have the software reset
//! bit set as well).
//!
//! \return This function does not return.
//
//*****************************************************************************
void
SysCtlReset(void)
{
    //
    // Perform a software reset request.  This will cause the device to reset,
    // no further code will be executed.
    //
    xHWREG(NVIC_APINT) = NVIC_APINT_VECTKEY | NVIC_APINT_SYSRESETREQ;

    //
    // The device should have reset, so this should never be reached.  Just in
    // case, loop forever.
    //
    while(1)
    {
    }
}

//*****************************************************************************
//
//! \brief Puts the processor into sleep mode.
//!
//! This function places the processor into sleep mode; it will not return
//! until the processor returns to run mode.  The peripherals that are enabled
//! via SysCtlPeripheralSleepEnable() continue to operate and can wake up the
//! processor (if automatic clock gating is enabled with
//! SysCtlPeripheralClockGating(), otherwise all peripherals continue to
//! operate).
//!
//! \return None.
//
//*****************************************************************************
void
SysCtlSleep(void)
{
    //
    // Wait for an interrupt.
    //
    xCPUwfi();
}

//*****************************************************************************
//
//! \brief The function is used to Reset Backup domain 
//!
//! \param None.
//!
//! The function is used to Reset Backup domain 
//!
//! \return None.
//
//*****************************************************************************
void 
SysCtlBackupDomainReset(void)
{
    xHWREG(RCC_BDCR) |= RCC_BDCR_BDRST;
}

//*****************************************************************************
//
//! \brief The function is used to Get HCLK clock and the UNIT is in Hz
//!
//! \param None.
//!
//! The function is used to Get HCLK clock and the UNIT is in Hz
//!
//! \return HCLK clock frequency in Hz 
//
//*****************************************************************************
unsigned long 
SysCtlHClockGet(void)
{
    unsigned long ulTemp = 0, ulPllMull = 0, ulPllSource = 0, ulPresc = 0;
    unsigned long ulHclk;

    //
    // STM32F10X_CL
    //
#ifdef  STM32F10X_CL
    unsigned long ulPrediv1Source = 0, ulPrediv1Factor = 0, ulPrediv2Factor = 0, 
                  ulPll2Mull = 0;
#endif 

#if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || defined (STM32F10X_HD_VL)
    unsigned long ulPrediv1Factor = 0;
#endif
    
    //
    // Get SYSCLK source
    //
    ulTemp = xHWREG(RCC_CFGR) & RCC_CFGR_SWS_M;
    switch (ulTemp)
    {
        //
        // HSI used as system clock
        //
        case 0x00: 
        {
            ulHclk = (unsigned long)8000000;
            break;
        }
        //
        // HSE used as system clock
        //
        case 0x04: 
        {
            ulHclk = s_ulExtClockMHz*1000000;
            break;
        }
        //
        // PLL used as system clock
        //
        case 0x08: 
        {
            //
            // Get PLL clock source and multiplication factor
            //
            ulPllMull = xHWREG(RCC_CFGR) & RCC_CFGR_PLLMUL_M;
            ulPllSource = xHWREG(RCC_CFGR) & RCC_CFGR_PLLSRC;
                  
#ifndef STM32F10X_CL      
            ulPllMull = ( ulPllMull >> 18) + 2;
      
            if (ulPllSource == 0x00)
            {
                //
                // HSI oscillator clock divided by 2 selected as PLL clock entry 
                //
                ulHclk = (8000000 >> 1) * ulPllMull;
            }
            else
            {
 #if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || defined (STM32F10X_HD_VL)
                ulPrediv1Factor = (xHWREG(RCC_CFGR2) & RCC_CFGR2_PREDIV1_M) + 1;
                //
                // HSE oscillator clock selected as PREDIV1 clock entry 
                //
                ulHclk = (s_ulExtClockMHz*1000000 / ulPrediv1Factor) * ulPllMull; 
 #else
                //
                // HSE selected as PLL clock entry 
                //
                if ((xHWREG(RCC_CFGR) & RCC_CFGR_PLLXTPRE) != 0)
                {
                    //
                    // HSE oscillator clock divided by 2 
                    //
                    ulHclk = ((s_ulExtClockMHz*1000000) >> 1) * ulPllMull;
                }
                else
                {
                    ulHclk = s_ulExtClockMHz*1000000 * ulPllMull;
                }
 #endif
            }
#else
            ulPllMull = ulPllMull >> 18;
          
            if (ulPllMull != 0x0D)
            {
                ulPllMull += 2;
            }
            else
            { 
                //
                // PLL multiplication factor = PLL input clock * 6.5 
                //
                ulPllMull = 13 / 2; 
            }
                  
            if (ulPllSource == 0x00)
            {
                //
                // HSI oscillator clock divided by 2 selected as PLL clock entry 
                //
                ulHclk = (8000000 >> 1) * ulPllMull;
            }
            else
            {
                //
                // PREDIV1 selected as PLL clock entry 
                //
                
                //
                // Get PREDIV1 clock source and division factor
                //
                ulPrediv1Source = (xHWREG(RCC_CFGR2) & RCC_CFGR2_PREDIV1SRC);
                ulPrediv1Factor = (xHWREG(RCC_CFGR2) & RCC_CFGR2_PREDIV1_M) + 1;
              
                if (ulPrediv1Source == 0)
                { 
                    //
                    // HSE oscillator clock selected as PREDIV1 clock entry 
                    //
                    ulHclk = (s_ulExtClockMHz*1000000 / ulPrediv1Factor) * ulPllMull;          
                }
                else
                {
                    //
                    // PLL2 clock selected as PREDIV1 clock entry 
                    //
        
                    //
                    // Get PREDIV2 division factor and PLL2 multiplication factor 
                    //
                    ulPrediv2Factor = ((xHWREG(RCC_CFGR2) & RCC_CFGR2_PREDIV2_M)
                                        >> RCC_CFGR2_PREDIV2_S) + 1;
                    ulPll2Mull = ((xHWREG(RCC_CFGR2) & RCC_CFGR2_PLL2MUL_M) >> 8 ) + 2; 
                    ulHclk = (((s_ulExtClockMHz*1000000 / ulPrediv2Factor) * 
                             ulPll2Mull) / ulPrediv1Factor) * ulPllMull;                         
                }
            }
#endif 
        break;
        }
        default: 
        {
            ulHclk = 8000000;
            break;
        }
    }
    ulTemp = (xHWREG(RCC_CFGR) & RCC_CFGR_HPRE_M) >> RCC_CFGR_HPRE_S;
    ulPresc = g_APBAHBPrescTable[ulTemp];
    ulHclk = ulHclk >> ulPresc;
    return ulHclk;
}

//*****************************************************************************
//
//! \brief The function is used to Get APB1 clock and the UNIT is in Hz
//!
//! \param None.
//!
//! The function is used to Get APB1 clock and the UNIT is in Hz
//!
//! \return APB1 clock frequency in Hz 
//
//*****************************************************************************
unsigned long 
SysCtlAPB1ClockGet(void)
{
    unsigned long ulTemp,ulAPB1Clock;
    ulAPB1Clock = SysCtlHClockGet();
    ulTemp = (xHWREG(RCC_CFGR) & RCC_CFGR_PPRE1_M) >> RCC_CFGR_PPRE1_S;
    ulTemp = (unsigned long)g_APBAHBPrescTable[ulTemp];
    ulAPB1Clock = ulAPB1Clock >> ulTemp;
    return ulAPB1Clock;
}

//*****************************************************************************
//
//! \brief The function is used to Get APB2 clock and the UNIT is in Hz
//!
//! \param None.
//!
//! The function is used to Get APB2 clock and the UNIT is in Hz
//!
//! \return APB2 clock frequency in Hz 
//
//*****************************************************************************
unsigned long 
SysCtlAPB2ClockGet(void)
{
    unsigned long ulTemp,ulAPB2Clock;
    ulAPB2Clock = SysCtlHClockGet();
    ulTemp = (xHWREG(RCC_CFGR) & RCC_CFGR_PPRE2_M) >> RCC_CFGR_PPRE2_S;
    ulTemp = (unsigned long)g_APBAHBPrescTable[ulTemp];
    ulAPB2Clock = ulAPB2Clock >> ulTemp;
    return ulAPB2Clock;
}




//*****************************************************************************
//
//! \brief Enables access to the RTC and backup registers.
//!
//! \param None.
//!
//! The function is used to enable access to the RTC and backup registers.
//!
//! \return None 
//
//*****************************************************************************
void 
SysCtlBackupAccessEnable(void)
{
    xHWREG(PWR_CR) |= PWR_CR_DBP;
}

//*****************************************************************************
//
//! \brief Disables access to the RTC and backup registers.
//!
//! \param None.
//!
//! The function is used to disable access to the RTC and backup registers.
//!
//! \return None 
//
//*****************************************************************************
void 
SysCtlBackupAccessDisable(void)
{
    xHWREG(PWR_CR) &= ~PWR_CR_DBP;
}

//*****************************************************************************
//
//! \brief Read Backup domain register 
//!
//! \param ulRegisterID which backup register you want to read.
//!
//!  The ulRegisterID can be one of follow value: BKP_DRx (x=1,2,3...42)
//!  
//! \return the content of the selected register 
//
//*****************************************************************************
unsigned long
SysCtlBackupDataRead(unsigned long ulRegisterID)
{
    xASSERT(
            //
            // medium-density and low-density devices
            // 
            (ulRegisterID == BKP_DR1 )||
            (ulRegisterID == BKP_DR2 )||
            (ulRegisterID == BKP_DR3 )||
            (ulRegisterID == BKP_DR4 )||
            (ulRegisterID == BKP_DR5 )||
            (ulRegisterID == BKP_DR6 )||
            (ulRegisterID == BKP_DR7 )||
            (ulRegisterID == BKP_DR8 )||
            (ulRegisterID == BKP_DR9 )||
            (ulRegisterID == BKP_DR10)||       
            //
            // high-density, XL-density and connectivity line devices
            //
            (ulRegisterID == BKP_DR11)||
            (ulRegisterID == BKP_DR12)||
            (ulRegisterID == BKP_DR13)||
            (ulRegisterID == BKP_DR14)||
            (ulRegisterID == BKP_DR15)||
            (ulRegisterID == BKP_DR16)||
            (ulRegisterID == BKP_DR17)||
            (ulRegisterID == BKP_DR18)||
            (ulRegisterID == BKP_DR19)||
            (ulRegisterID == BKP_DR20)||
            (ulRegisterID == BKP_DR21)||
            (ulRegisterID == BKP_DR22)||
            (ulRegisterID == BKP_DR23)||
            (ulRegisterID == BKP_DR24)||
            (ulRegisterID == BKP_DR25)||
            (ulRegisterID == BKP_DR26)||
            (ulRegisterID == BKP_DR27)||
            (ulRegisterID == BKP_DR28)||
            (ulRegisterID == BKP_DR29)||
            (ulRegisterID == BKP_DR30)||
            (ulRegisterID == BKP_DR31)||
            (ulRegisterID == BKP_DR32)||
            (ulRegisterID == BKP_DR33)||
            (ulRegisterID == BKP_DR34)||
            (ulRegisterID == BKP_DR35)||
            (ulRegisterID == BKP_DR36)||
            (ulRegisterID == BKP_DR37)||
            (ulRegisterID == BKP_DR38)||
            (ulRegisterID == BKP_DR39)||
            (ulRegisterID == BKP_DR40)||
            (ulRegisterID == BKP_DR41)||
            (ulRegisterID == BKP_DR42)
            );
    return xHWREG(ulRegisterID);
}

//*****************************************************************************
//
//! \brief Write Backup domain register 
//!
//! \param ulRegisterID which backup register you want to write.
//!
//!  The ulRegisterID can be one of follow value: BKP_DRx (x=1,2,3...42)
//! \param ulValue half word data, the data that you want to write into 
//!  
//! \return None 
//
//*****************************************************************************
void
SysCtlBackupDataWrite(unsigned long ulRegisterID,unsigned long ulValue)
{
    xASSERT(
            //
            // medium-density and low-density devices
            // 
            (ulRegisterID == BKP_DR1 )||
            (ulRegisterID == BKP_DR2 )||
            (ulRegisterID == BKP_DR3 )||
            (ulRegisterID == BKP_DR4 )||
            (ulRegisterID == BKP_DR5 )||
            (ulRegisterID == BKP_DR6 )||
            (ulRegisterID == BKP_DR7 )||
            (ulRegisterID == BKP_DR8 )||
            (ulRegisterID == BKP_DR9 )||
            (ulRegisterID == BKP_DR10)||       
            //
            // high-density, XL-density and connectivity line devices
            //
            (ulRegisterID == BKP_DR11)||
            (ulRegisterID == BKP_DR12)||
            (ulRegisterID == BKP_DR13)||
            (ulRegisterID == BKP_DR14)||
            (ulRegisterID == BKP_DR15)||
            (ulRegisterID == BKP_DR16)||
            (ulRegisterID == BKP_DR17)||
            (ulRegisterID == BKP_DR18)||
            (ulRegisterID == BKP_DR19)||
            (ulRegisterID == BKP_DR20)||
            (ulRegisterID == BKP_DR21)||
            (ulRegisterID == BKP_DR22)||
            (ulRegisterID == BKP_DR23)||
            (ulRegisterID == BKP_DR24)||
            (ulRegisterID == BKP_DR25)||
            (ulRegisterID == BKP_DR26)||
            (ulRegisterID == BKP_DR27)||
            (ulRegisterID == BKP_DR28)||
            (ulRegisterID == BKP_DR29)||
            (ulRegisterID == BKP_DR30)||
            (ulRegisterID == BKP_DR31)||
            (ulRegisterID == BKP_DR32)||
            (ulRegisterID == BKP_DR33)||
            (ulRegisterID == BKP_DR34)||
            (ulRegisterID == BKP_DR35)||
            (ulRegisterID == BKP_DR36)||
            (ulRegisterID == BKP_DR37)||
            (ulRegisterID == BKP_DR38)||
            (ulRegisterID == BKP_DR39)||
            (ulRegisterID == BKP_DR40)||
            (ulRegisterID == BKP_DR41)||
            (ulRegisterID == BKP_DR42)
            );
     xHWREG(ulRegisterID) = (ulValue & 0x0000FFFF);
}


//*****************************************************************************
//
//! \brief configures the tamper pin active level 
//!
//! \param select the signal output on the tamper pin
//!  value can be one of the following values:
//! \ref SYSCTL_RTC_NONE, \ref SYSCTL_RTC_SECOND,
//! \ref SYSCTL_RTC_ALARM, \ref SYSCTL_RTC_CALIBCLOCK,
//! 
//!
//! \return none 
//
//*****************************************************************************
void SysCtlRtcOutPutConfig(unsigned long ulRTCOutputSource)
{
    xASSERT(
            (ulRTCOutputSource == SYSCTL_RTC_NONE      )  ||
            (ulRTCOutputSource == SYSCTL_RTC_SECOND    )  ||
            (ulRTCOutputSource == SYSCTL_RTC_ALARM     )  ||
            (ulRTCOutputSource == SYSCTL_RTC_CALIBCLOCK)  
           );

    xHWREG(BKP_RTCCR) &=  BKP_RTCCR_MASK;
    xHWREG(BKP_RTCCR) |=  ulRTCOutputSource;

