renjun1234/cox/CoX/CoX_Peripheral/CoX_Peripheral_STM32F1xx/libcox/xsysctl.c
}

//*****************************************************************************
//
//! \brief Set the rtc calibration value
//!
//! \param The value that indicates the numbers of clock pulses that will be 
//!  ignored every 2^20 clock pulses 
//! 
//!
//! \return none 
//
//*****************************************************************************
void SysCtlSetCalibValue(unsigned long ulValue)
{
    xASSERT((ulValue >= 0x00000000) && (ulValue <= 0x0000007F));

    xHWREG(BKP_RTCCR) &= ~BKP_RTCCR_CAL_M;
    xHWREG(BKP_RTCCR) |=  (ulValue & 0x0000007F);

}



//*****************************************************************************
//
//! \brief configures the tamper pin active level 
//!
//! \param ulLevelMode specifies the volatge level for active tamper pin 
//!
//! the tamper active level is chosen with one of the following values:
//! \ref BKP_CR_TPAL_LOW, \ref BKP_CR_TPAL_HIGH.
//!
//! the function is used to configures the threshold detected by the 
//! power voltage detector(pvd).
//!
//! \return none 
//
//*****************************************************************************
void SysCtlTamperPinActiveLevelConfig(unsigned long ulLevelMode)
{
    xASSERT(
            (ulLevelMode == BKP_CR_TPAL_HIGH)||
            (ulLevelMode == BKP_CR_TPAL_LOW )
            );
    if (ulLevelMode == BKP_CR_TPAL_LOW)
    {
       xHWREG(BKP_CR) |= BKP_CR_TPAL;
    }
    else
    {
       xHWREG(BKP_CR) &= ~BKP_CR_TPAL;
    }
}


//*****************************************************************************
//
//! \brief Enable the Tamper Pin functionality.
//!
//! \param None.
//!
//! The function is used to Enable the Tamper Pin functionality.
//!
//! \return None 
//
//*****************************************************************************

void SysCtlTamperPinEnable(void)
{
    xHWREG(BKP_CR) |= BKP_CR_TPE;
}

//*****************************************************************************
//
//! \brief Disable the Tamper Pin functionality.
//!
//! \param None.
//!
//! The function is used to Disable the Tamper Pin functionality.
//!
//! \return None 
//
//*****************************************************************************

void SysCtlTamperPinDisable(void)
{
    xHWREG(BKP_CR) &= ~BKP_CR_TPE;
}


//*****************************************************************************
//
//! \brief Get the Tamper interrupts flag.
//!
//! \param None.  
//!
//! Get the Tamper interrupt flag.
//!
//! \return the return value is one of the following:
//! \ref xtrue
//! \reg xfalse 
//
//*****************************************************************************
unsigned long SysCtlTamperIntFlagGet(void)
{
   return (xHWREG(BKP_CSR) & BKP_CSR_TIF); 
}


//*****************************************************************************
//
//! \brief Get the Tamper Event flag.
//!
//! \param None.  
//!
//! Get the Tamper Event flag.
//!
//! \return the return value is one of the following:
//! \ref xtrue
//! \reg xfalse 
//
//*****************************************************************************
unsigned long SysCtlTamperEventFlagGet(void)
{
   return (xHWREG(BKP_CSR) & BKP_CSR_TEF); 
}

//*****************************************************************************
//
//! \brief Enable the Tamper Pin interrupt.
//!
//! \param None.
//!
//! The function is used to Enable the Tamper Pin interrupt.
//!
//! \return None 
//
//*****************************************************************************
void SysCtlTamperIntEnable(void)
{
    xHWREG(BKP_CSR) |= BKP_CSR_TPIE; 
}


//*****************************************************************************
//
//! \brief Disable the Tamper Pin interrupt.
//!
//! \param None.
//!
//! The function is used to Disable the Tamper Pin interrupt.
//!
//! \return None 
//
//*****************************************************************************
void SysCtlTamperIntDisable(void)
{
    xHWREG(BKP_CSR) &= ~BKP_CSR_TPIE; 
}

//*****************************************************************************
//
//! \brief Clear the Tamper Pin interrupt Flag.
//!
//! \param None.
//!
//! The function is used to Clear the Tamper Pin interrupt Flag.
//!
//! \return None 
//
//*****************************************************************************
void SysCtlTamperIntFlagClear(void)
{
    xHWREG(BKP_CSR) |= BKP_CSR_CTI; 
}


//*****************************************************************************
//
//! \brief Clear the Tamper Pin Event Flag.
//!
//! \param None.
//!
//! The function is used to Clear the Tamper Pin Event Flag.
//!
//! \return None 
//
//*****************************************************************************
void SysCtlTamperEventFlagClear(void)
{
    xHWREG(BKP_CSR) |= BKP_CSR_CTE; 
}


//*****************************************************************************
//
//! \brief Configures the voltage threshold detected by the Power Voltage 
//! Detector(PVD).
//!
//! \param ulConfig specifies the PVD detection level configurations
//!
//! The \e ulConfig parameter is the logical OR of two different values,
//! many of which are grouped into sets where only one can be chosen.
//!
//! The enable or disable PVD is chosen with one of the following values:
//! \ref SYSCTL_PVD_EN, \ref SYSCTL_PVD_DIS.
//!
//! The PVD detection level is chosen with one of the following values:
//! \ref SYSCTL_PVDLEVEL_2V2, \ref SYSCTL_PVDLEVEL_2V3 \ref SYSCTL_PVDLEVEL_2V4,
//! \ref SYSCTL_PVDLEVEL_2V5, \ref SYSCTL_PVDLEVEL_2V6, \ref SYSCTL_PVDLEVEL_2V7,
//! \ref SYSCTL_PVDLEVEL_2V8, \ref SYSCTL_PVDLEVEL_2V9.
//!
//! The function is used to configures the voltage threshold detected by the 
//! Power Voltage Detector(PVD).
//!
//! \return None 
//
//*****************************************************************************
void
SysCtlPVDLevelConfig(unsigned long ulConfig)
{
    xASSERT(
            (ulConfig == SYSCTL_PVDLEVEL_2V2)||
            (ulConfig == SYSCTL_PVDLEVEL_2V3)||
            (ulConfig == SYSCTL_PVDLEVEL_2V4)||
            (ulConfig == SYSCTL_PVDLEVEL_2V5)||
            (ulConfig == SYSCTL_PVDLEVEL_2V6)||
            (ulConfig == SYSCTL_PVDLEVEL_2V7)||
            (ulConfig == SYSCTL_PVDLEVEL_2V8)||
            (ulConfig == SYSCTL_PVDLEVEL_2V9)
            );

